In [1]:
import pandas as pd

In [3]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\scl\anaconda3\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\scl\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\scl\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\scl\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\scl\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\scl\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

WARNING: Ignoring invalid distribution ~treamlit (C:\Users\scl\anaconda3\Lib\site-packages)
WARNING: Ignoring invalid distribution ~treamlit (C:\Users\scl\anaconda3\Lib\site-packages)
WARNING: Ignoring invalid distribution ~treamlit (C:\Users\scl\anaconda3\Lib\site-packages)

In [3]:
df = pd.read_csv('titanic.csv')

In [4]:
df

,survived,pclass,name,sex,age,fare,sibsp,parch
0,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,1,0
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,1,0
2,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,0,0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,1,0
4,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,0,0
...,...,...,...,...,...,...,...,...
709,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,29.1250,0,5
710,0,2,"Montvila, Rev. Juozas",male,27.0,13.0000,0,0
711,1,1,"Graham, Miss. Margaret Edith",female,19.0,30.0000,0,0
712,1,1,"Behr, Mr. Karl Howell",male,26.0,30.0000,0,0
713,0,3,"Dooley, Mr. Patrick",male,32.0,7.7500,0,0

In [5]:
type(df)

pandas.core.frame.DataFrame

In [7]:
df.head(2)

,survived,pclass,name,sex,age,fare,sibsp,parch
0,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,1,0
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,1,0

In [8]:
df.tail(3)

,survived,pclass,name,sex,age,fare,sibsp,parch
711,1,1,"Graham, Miss. Margaret Edith",female,19.0,30.00,0,0
712,1,1,"Behr, Mr. Karl Howell",male,26.0,30.00,0,0
713,0,3,"Dooley, Mr. Patrick",male,32.0,7.75,0,0

In [9]:
df.shape

(714, 8)

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 714 entries, 0 to 713
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  714 non-null    int64
 1   pclass    714 non-null    int64
 2   name      714 non-null    object
 3   sex       714 non-null    object
 4   age       714 non-null    float64
 5   fare      714 non-null    float64
 6   sibsp     714 non-null    int64
 7   parch     714 non-null    int64
dtypes: float64(2), int64(4), object(2)
memory usage: 44.8+ KB

In [11]:
df.columns

Index(['survived', 'pclass', 'name', 'sex', 'age', 'fare', 'sibsp', 'parch'], dtype='object')

In [12]:
df

,survived,pclass,name,sex,age,fare,sibsp,parch
0,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,1,0
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,1,0
2,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,0,0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,1,0
4,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,0,0
...,...,...,...,...,...,...,...,...
709,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,29.1250,0,5
710,0,2,"Montvila, Rev. Juozas",male,27.0,13.0000,0,0
711,1,1,"Graham, Miss. Margaret Edith",female,19.0,30.0000,0,0
712,1,1,"Behr, Mr. Karl Howell",male,26.0,30.0000,0,0
713,0,3,"Dooley, Mr. Patrick",male,32.0,7.7500,0,0

In [15]:
df[['pclass','fare']].head(10)

   pclass     fare
0       3   7.2500
1       1  71.2833
2       3   7.9250
3       1  53.1000
4       3   8.0500
5       1  51.8625
6       3  21.0750
7       3  11.1333
8       2  30.0708
9       3  16.7000

In [17]:
df['pclass']

0      3
1      1
2      3
3      1
4      3
      ..
709    3
710    2
711    1
712    1
713    3
Name: pclass, Length: 714, dtype: int64

In [18]:
type(df['pclass'])

pandas.core.series.Series

In [19]:
type(df[['pclass']])

pandas.core.frame.DataFrame

In [21]:
df[['name','age','sex','survived']]

                                                  name   age     sex  survived
0                              Braund, Mr. Owen Harris  22.0    male         0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0  female         1
2                               Heikkinen, Miss. Laina  26.0  female         1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0  female         1
4                             Allen, Mr. William Henry  35.0    male         0
..                                                 ...   ...     ...       ...
709               Rice, Mrs. William (Margaret Norton)  39.0  female         0
710                              Montvila, Rev. Juozas  27.0    male         0
711                       Graham, Miss. Margaret Edith  19.0  female         1
712                              Behr, Mr. Karl Howell  26.0    male         1
713                                Dooley, Mr. Patrick  32.0    male         0

[714 rows x 4 columns]

In [ ]:
https://calmcode.io/static/data/titanic.csv

In [24]:
pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/refs/heads/master/titanic.csv')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [25]:
pd.read_excel('sample_data.xlsx', sheet_name='sudh')

    ID       Name  Age   City  Salary
0    1   Person_1   21  CityA   30750
1    2   Person_2   22  CityB   31500
2    3   Person_3   23  CityC   32250
3    4   Person_4   24  CityD   33000
4    5   Person_5   25  CityA   33750
5    6   Person_6   26  CityB   34500
6    7   Person_7   27  CityC   35250
7    8   Person_8   28  CityD   36000
8    9   Person_9   29  CityA   36750
9   10  Person_10   20  CityB   37500
10  11  Person_11   21  CityC   38250
11  12  Person_12   22  CityD   39000
12  13  Person_13   23  CityA   39750
13  14  Person_14   24  CityB   40500
14  15  Person_15   25  CityC   41250
15  16  Person_16   26  CityD   42000
16  17  Person_17   27  CityA   42750
17  18  Person_18   28  CityB   43500
18  19  Person_19   29  CityC   44250
19  20  Person_20   20  CityD   45000

In [26]:
pd.read_excel('sample_data.xlsx', sheet_name='sudh1')

   ID       Name  Age   City  Salary
0   1   Person_1   21  CityA   30750
1   2   Person_2   22  CityB   31500
2   3   Person_3   23  CityC   32250
3   4   Person_4   24  CityD   33000
4   5   Person_5   25  CityA   33750
5   6   Person_6   26  CityB   34500
6   7   Person_7   27  CityC   35250
7   8   Person_8   28  CityD   36000
8   9   Person_9   29  CityA   36750
9  10  Person_10   20  CityB   37500

In [27]:
df

,survived,pclass,name,sex,age,fare,sibsp,parch
0,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,1,0
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,1,0
2,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,0,0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,1,0
4,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,0,0
...,...,...,...,...,...,...,...,...
709,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,29.1250,0,5
710,0,2,"Montvila, Rev. Juozas",male,27.0,13.0000,0,0
711,1,1,"Graham, Miss. Margaret Edith",female,19.0,30.0000,0,0
712,1,1,"Behr, Mr. Karl Howell",male,26.0,30.0000,0,0
713,0,3,"Dooley, Mr. Patrick",male,32.0,7.7500,0,0

In [29]:
df[df['survived'] == 1]

,survived,pclass,name,sex,age,fare,sibsp,parch
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,1,0
2,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,0,0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,1,0
7,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,11.1333,0,2
8,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,30.0708,1,0
...,...,...,...,...,...,...,...,...
700,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,7.2250,0,0
703,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,83.1583,0,1
704,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,26.0000,0,1
711,1,1,"Graham, Miss. Margaret Edith",female,19.0,30.0000,0,0
712,1,1,"Behr, Mr. Karl Howell",male,26.0,30.0000,0,0

In [30]:
df[df['age'] <= 18]

,survived,pclass,name,sex,age,fare,sibsp,parch
6,0,3,"Palsson, Master. Gosta Leonard",male,2.0,21.0750,3,1
8,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,30.0708,1,0
9,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,16.7000,1,1
13,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,7.8542,0,0
15,0,3,"Rice, Master. Eugene",male,2.0,29.1250,4,1
...,...,...,...,...,...,...,...,...
680,0,3,"Boulos, Miss. Nourelain",female,9.0,15.2458,1,1
681,1,1,"Lines, Miss. Mary Conover",female,16.0,39.4000,0,1
683,1,3,"Aks, Mrs. Sam (Leah Rosen)",female,18.0,9.3500,0,1
694,1,3,"Johnson, Master. Harold Theodor",male,4.0,11.1333,1,1
700,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,7.2250,0,0

In [ ]:
df[ (df['survived'] ==1 ) & (df['age'] <=18 ) ]

,survived,pclass,name,sex,age,fare,sibsp,parch
8,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.00,30.0708,1,0
9,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.00,16.7000,1,1
19,1,3,"McGowan, Miss. Anna ""Annie""",female,15.00,8.0292,0,0
30,1,3,"Nicola-Yarred, Miss. Jamila",female,14.00,11.2417,1,0
33,1,2,"Laroche, Miss. Simonne Marie Anne Andree",female,3.00,41.5792,1,2
...,...,...,...,...,...,...,...,...
664,1,2,"Richards, Master. George Sibley",male,0.83,18.7500,1,1
681,1,1,"Lines, Miss. Mary Conover",female,16.00,39.4000,0,1
683,1,3,"Aks, Mrs. Sam (Leah Rosen)",female,18.00,9.3500,0,1
694,1,3,"Johnson, Master. Harold Theodor",male,4.00,11.1333,1,1
700,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.00,7.2250,0,0

In [34]:
df['new_col_sudh'] = df['age'] * 2

In [35]:
df

,survived,pclass,name,sex,age,fare,sibsp,parch,new_col_sudh
0,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,1,0,44.0
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,1,0,76.0
2,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,0,0,52.0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,1,0,70.0
4,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,0,0,70.0
...,...,...,...,...,...,...,...,...,...
709,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,29.1250,0,5,78.0
710,0,2,"Montvila, Rev. Juozas",male,27.0,13.0000,0,0,54.0
711,1,1,"Graham, Miss. Margaret Edith",female,19.0,30.0000,0,0,38.0
712,1,1,"Behr, Mr. Karl Howell",male,26.0,30.0000,0,0,52.0
713,0,3,"Dooley, Mr. Patrick",male,32.0,7.7500,0,0,64.0

In [36]:
df['fare_10dicount'] = df['fare'] * 0.9

In [37]:
df

,survived,pclass,name,sex,age,fare,sibsp,parch,new_col_sudh,fare_10dicount
0,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,1,0,44.0,6.52500
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,1,0,76.0,64.15497
2,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,0,0,52.0,7.13250
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,1,0,70.0,47.79000
4,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,0,0,70.0,7.24500
...,...,...,...,...,...,...,...,...,...,...
709,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,29.1250,0,5,78.0,26.21250
710,0,2,"Montvila, Rev. Juozas",male,27.0,13.0000,0,0,54.0,11.70000
711,1,1,"Graham, Miss. Margaret Edith",female,19.0,30.0000,0,0,38.0,27.00000
712,1,1,"Behr, Mr. Karl Howell",male,26.0,30.0000,0,0,52.0,27.00000
713,0,3,"Dooley, Mr. Patrick",male,32.0,7.7500,0,0,64.0,6.97500

In [39]:
df.to_csv('titanic_modified.csv', index=False)

In [41]:
df.to_csv('titanic_modified1.csv', index=True)

In [42]:
df

,survived,pclass,name,sex,age,fare,sibsp,parch,new_col_sudh,fare_10dicount
0,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,1,0,44.0,6.52500
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,1,0,76.0,64.15497
2,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,0,0,52.0,7.13250
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,1,0,70.0,47.79000
4,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,0,0,70.0,7.24500
...,...,...,...,...,...,...,...,...,...,...
709,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,29.1250,0,5,78.0,26.21250
710,0,2,"Montvila, Rev. Juozas",male,27.0,13.0000,0,0,54.0,11.70000
711,1,1,"Graham, Miss. Margaret Edith",female,19.0,30.0000,0,0,38.0,27.00000
712,1,1,"Behr, Mr. Karl Howell",male,26.0,30.0000,0,0,52.0,27.00000
713,0,3,"Dooley, Mr. Patrick",male,32.0,7.7500,0,0,64.0,6.97500

In [43]:
df.sort_values(by='age', ascending=False)

,survived,pclass,name,sex,age,fare,sibsp,parch,new_col_sudh,fare_10dicount
498,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.00,30.0000,0,0,160.00,27.00000
679,0,3,"Svensson, Mr. Johan",male,74.00,7.7750,0,0,148.00,6.99750
393,0,1,"Artagaveytia, Mr. Ramon",male,71.00,49.5042,0,0,142.00,44.55378
74,0,1,"Goldschmidt, Mr. George B",male,71.00,34.6542,0,0,142.00,31.18878
91,0,3,"Connors, Mr. Patrick",male,70.50,7.7500,0,0,141.00,6.97500
...,...,...,...,...,...,...,...,...,...,...
59,1,2,"Caldwell, Master. Alden Gates",male,0.83,29.0000,0,2,1.66,26.10000
509,1,3,"Baclini, Miss. Eugenie",female,0.75,19.2583,2,1,1.50,17.33247
374,1,3,"Baclini, Miss. Helene Barbara",female,0.75,19.2583,2,1,1.50,17.33247
602,1,2,"Hamalainen, Master. Viljo",male,0.67,14.5000,1,1,1.34,13.05000
640,1,3,"Thomas, Master. Assad Alexander",male,0.42,8.5167,0,1,0.84,7.66503

In [44]:
df.sort_values(by='age', ascending=True)

,survived,pclass,name,sex,age,fare,sibsp,parch,new_col_sudh,fare_10dicount
640,1,3,"Thomas, Master. Assad Alexander",male,0.42,8.5167,0,1,0.84,7.66503
602,1,2,"Hamalainen, Master. Viljo",male,0.67,14.5000,1,1,1.34,13.05000
374,1,3,"Baclini, Miss. Helene Barbara",female,0.75,19.2583,2,1,1.50,17.33247
509,1,3,"Baclini, Miss. Eugenie",female,0.75,19.2583,2,1,1.50,17.33247
59,1,2,"Caldwell, Master. Alden Gates",male,0.83,29.0000,0,2,1.66,26.10000
...,...,...,...,...,...,...,...,...,...,...
91,0,3,"Connors, Mr. Patrick",male,70.50,7.7500,0,0,141.00,6.97500
393,0,1,"Artagaveytia, Mr. Ramon",male,71.00,49.5042,0,0,142.00,44.55378
74,0,1,"Goldschmidt, Mr. George B",male,71.00,34.6542,0,0,142.00,31.18878
679,0,3,"Svensson, Mr. Johan",male,74.00,7.7750,0,0,148.00,6.99750
498,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.00,30.0000,0,0,160.00,27.00000

In [45]:
df['sex'].value_counts()

sex
male      453
female    261
Name: count, dtype: int64

In [46]:
df['survived'].value_counts()

survived
0    424
1    290
Name: count, dtype: int64